[
  {
    "id": "ep005",
    "title": "Stereotypes In The Mind",
    "shortDescription": "How do stereotypes arise?",
    "longDescription": "Whether it’s through the news, TV shows, books or movies, we’ve all likely been exposed to some sort of stereotype before. Examples include racial stereotypes, gender stereotypes, age stereotypes, and so on. We all hold various stereotypes ourselves, too. But these stereotypes don’t just pop out of thin air, and we certainly aren't born with these preconceived thoughts. So, where do they come from? How do stereotypes arise? We’ll explore how stereotypes arise in this episode, ‘Stereotypes In The Mind’, through an interview with an expert: Tiffany Ito, a professor in the Department of Psychology and Neuroscience at the University of Colorado Boulder. Her research includes multi-level approaches to better understand stereotypes and prejudice. In the episode, you’ll learn about things like social learning, implicit and explicit stereotyping and fMRI and ERP.",
    "image": "images/mind.jpg",
    "audio": "audio/stereotypesbrain.mp3",
    "guests": ["Featuring Dr. Tiffany Ito"],
    "date": "2025-11-27",
    "tags": ["psychology", "brain", "stereotypes"]
  },
  
  
  
  {
    "id": "ep004",
    "title": "The Voices Of Our Community: Stereotyping. Episode 2.",
    "shortDescription": "Using empathy and personal narrative to understand stereotyping, second part.",
    "longDescription": Stereotyping is a pressing issue in today’s society, with its impacts ranging from smaller ways like assigning colors to gender to big impacts like ingrained hate and systemic discrimination. Though its categorization can seem small at first, it can and will amount to bigger acts of hate, and since both conscious and unconscious stereotyping are so prevalent throughout the world, it’s essential to fully understand what it actually is. These stereotypes are not harmless social habits, and so it’s important we understand how they’ve impacted different people in different ways, which we will do in this episode. Social issues like this one exist within the people of society, and so this is where the solutions lie, too. ‘The Voices of our Community: Stereotyping' mini series consists of two episodes- each five- eight minutes in length-where the spotlight is on the community, not dictionary definitions, not professionals, but the people experiencing stereotyping first hand, in society, every day. When at school, walking around downtown, in coffee shops, and so on,  I stopped a couple of people, most I hadn't met before then, and asked them about their perspective on stereotyping in our society- the ways they personally face them, and their suggestions to lessen them. These interviews range all the way from teens to adults. When utilizing empathy, solely listening to people’s experiences and ideas on potential solutions can teach us so much more than any textbook could. You will notice how many similar themes are brought up, even though not all of them heard what others had said. This mini-series will broaden your perspective and deepen your understanding of what a stereotype really is, and how to lessen it. We’ll explore themes like the pyramid of hate, we’ll utilize empathy, and we’ll quickly understand how stereotyping arises. If you want to share a similar experience or possible solution to this social issue or others, whether you're an organization combating social issues or an individual who wants to share their experiences, feel free to send me a voice memo at rheabtrivedi@gmail.com, and I can feature you in a future episode..",
    "image": "images/stereotyped.jpg",
    "audio": "audio/Mini2.mp3",
    "guests": ["Dr. C", "Dr. D."],
    "date": "2025-01-03",
    "tags": ["empathy", "experience", "stereotypes"]
  },
  {
    "id": "ep003",
    "title": "Voices of our Community: Stereotyping. Episode 1.",
    "shortDescription": "Using empathy and personal narrative to understand stereotyping, first part.",
    "longDescription": "Stereotyping is a pressing issue in today’s society, with its impacts ranging from smaller ways like assigning colors to gender to big impacts like ingrained hate and systemic discrimination. Though its categorization can seem small at first, it can and will amount to bigger acts of hate, and since both conscious and unconscious stereotyping are so prevalent throughout the world, it’s essential to fully understand what it actually is. These stereotypes are not harmless social habits, and so it’s important we understand how they’ve impacted different people in different ways, which we will do in this episode. Social issues like this one exist within the people of society, and so this is where the solutions lie, too. ‘The Voices of our Community: Stereotyping' mini series consists of two episodes- each five- eight minutes in length-where the spotlight is on the community, not dictionary definitions, not professionals, but the people experiencing stereotyping first hand, in society, every day. When at school, walking around downtown, in coffee shops, and so on,  I stopped a couple of people, most I hadn't met before then, and asked them about their perspective on stereotyping in our society- the ways they personally face them, and their suggestions to lessen them. These interviews range all the way from teens to adults. When utilizing empathy, solely listening to people’s experiences and ideas on potential solutions can teach us so much more than any textbook could. You will notice how many similar themes are brought up, even though not all of them heard what others had said. This mini-series will broaden your perspective and deepen your understanding of what a stereotype really is, and how to lessen it. We’ll explore themes like the pyramid of hate, we’ll utilize empathy, and we’ll quickly understand how stereotyping arises. If you want to share a similar experience or possible solution to this social issue or others, whether you're an organization combating social issues or an individual who wants to share their experiences, feel free to send me a voice memo at rheabtrivedi@gmail.com, and I can feature you in a future episode.",
    "image": "images/stereotyped.jpg",
    "audio": "audio/minifirst.mp3",
    "guests": ["Community(people of Colorado)"],
    "date": "2025-01-01",
    "tags": ["empathy", "experience", "stereotypes"]
  },
  {
    "id": "ep002",
    "title": "Stereotyped",
    "shortDescription": "Understanding stereotyping through community perspective and experience. This episode encompasses the themes from 'Voices of our Community: Stereotyping' mini series.",
    "longDescription": "This episode summarizes 'The voices of our community: Stereotyping' mini series by including some of the interviews from the people of our community (some of them cut to be shorter compared to the mini series) and their perspective on the issues of stereotyping- sharing both personal narratives and potential solutions. The goal of this episode is to broaden your perspective and fully understand how stereotypes impact different people in different ways. Listen to more interviews, with minimal cuts in 'The Voices of Our Community: Stereotyping' mini series! If you want to share a similar experience or possible solution to this social issue or others, whether you're an organization combating social issues or an individual who wants to share their experiences, feel free to send me a voice memo at rhea.b.trivedi@gmail.com, and I can feature you in a future episode. ",
    "image": "images/stereotyped.jpg",
    "audio": "audio/over.mp3",
    "guests": ["Community (People of Colorado). *This episode is a 2025 NPR Student Podcast Challenge Honorable Mention*"],
    "date": "2025-11-23",
    "tags": ["psychology", "brain", "stereotypes"]
  },
  {
    "id": "ep001",
    "title": "Embarrassment, Unpacked",
    "shortDescription": "Freud, 1st hand stories, and the Psychology of Embarrassment.",
    "longDescription": "Ever tripped in front of a lot of people? Wore your shirt inside out the whole day? Spilled water all over your pants and had to go to work or school? Well, if you’ve experienced this or something similar, you’ve likely experienced embarrassment, a complex, self-conscious, and social emotion (one that exists in the presence of other people). I’ve found that it’s easy to explain what we are feeling when it’s a basic emotion like sadness, but with a complex one like embarrassment, it can be hard to even fully understand. When do the ‘embarrassing’ things we do become embarrassing? Why is that the case? Why do we get embarrassed by such small things? This episode of Mind In Society explores embarrassment through analysing the experiences of 13-17 year olds with embarrassment, diving into Sigmund Freud's Structural Model of the Psyche, and discussing how embarrassment is defined today. This episode aims to better your understanding of what is actually happening when we feel embarrassed, taking a trip through narrative and explanation. Listen to find out!",
    "image": "images/embar.jpg",
    "audio": "audio/episode1.mp3",
    "guests": ["Featuring community: 13-17 year olds"],
    "date": "2025-11-22",
    "tags": ["social cognition","embarrassment", "Freud" ]
  }
]
